[
{"content": "COMPUTER SCIENCE DEPARTMENT                                                                       Sections                                 NewsEvents ListingStaff IntranetHomeProspective StudentsResearchIndustry & OutreachCareersCurrent StudentsPeopleAbout UsWomen in Computer ScienceStaff Intranet                                                             Home                                                                                                                                      The UCL Department of Computer ScienceIn the 2014 Research Excellence Framework (REF) evaluation UCL was ranked in first place for Computer Science, out of 89 Universities assessed, and considerably ahead of other Institutions. 61% of its research work is rated as world-leading (the highest possible category) and 96% of its research work is rated as internationally excellent.UCL researchers in Computer Science and Informatics received a ‘grade point average’ of 3.57 (out of 4) and submitted over 70 staff to be assessed in REF2014. UCL Computer Science has made seminal contributions across the full range of its core strengths and associated 11 research groups and 8 centres, including the Centre for Health Informatics & Multiprofessional Education (CHIME), Biomedical Physics & Biochemical Engineering, and the Centre for Medical Image Computing (CMIC). More >>Andrea Bittau, 1983-2017It is with great sorrow that we report the death of Andrea Bittau, who earned his BSc and PhD degrees at UCL Computer Science, and was a much respected student and colleague across the department. An obituary can be found here. Memories of Andrea can be added by sending them to Steve Marchant.  To honor and remember Andrea’s life, and his talent and passion for computer systems research, the Andrea Bittau Memorial Scholarship has been established, which will support a PhD student at UCL Computer Science. Learn more about the memorial scholarship here.                                                                                      UCL Data Science Student Challenge: round 2.0                                            Microsoft’s global series of data science hackathons made its second stop in the UK at UCL                            More news >                                                                                                                                Computer Science winners at UCL Engineering Engagement Awards                                            Staff and students recognised for contribution to engagement and outreach over the past year                            More news >                                                                                                                                From the BBC Micro to micro:bit and beyond                                            UCL & BBC recognised for providing new ways to code, create & invent using IoT toolkits in innovative ways                            More news >                                                                                                                                Undergraduates shine at Google Hash Code                                            UCL ranked top UK university in global algorithmic competition                            More news >                                                                                                                                UCL Machine Learning graduate to present at leading Deep Learning conference                                            Masters thesis leads to conference paper on memory-augmented neural language models                            More news >                                                                              Tweets by @uclcs            !function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+\"://platform.twitter.com/widgets.js\";fjs.parentNode.insertBefore(js,fjs);}}(document,\"script\",\"twitter-wjs\");          Virtual Open DaysUCL Computer Science models the World                                                                                                                                                                                                                                     © 1999-2017 UCL                                                                                                Desktop Site                                                                                                           Accessibility                                                                                                         Help                                                                                                                                                       Disclaimer                                                                                                           Cookies                                                                            Privacy", "link": "http://www.cs.ucl.ac.uk/mobile/home/"},
{"content": "Department of Computer Science› Home ›› NewsMobile VersionHomeProspective StudentsResearchIndustry & OutreachCareersCurrent StudentsPeopleAbout UsWomen in Computer ScienceStaff IntranetForthcoming Events21 Mar 13:00Intelligent Systems Seminar:  Julia: Solving the two language problem in machine learning22 Mar 13:00CMIC Seminar: Kin Quan and Claire Cury23 Mar 13:00UCLIC Seminar: Human-in-the-Loop Cyber-Physical Systems using smartphones23 Mar 16:00InfoSec Seminar: Characterization of Internet Censorship from Multiple...28 Mar 13:00Virtual Open Day: MSc Robotics and Computation29 Mar 15:00Virtual Open Day: MSc Computational Finance05 Apr 17:00Inaugural Lecture: Data-Driven MedicineComputer Science NewsAthena SWAN Silver Award for UCL Computer ScienceUCL Computer Science has been awarded an Athena SWAN Silver Award. This builds on our earlier success in obtaining a bronze award in 2012. We are one of only three Computer Science Departments in the UK to have achieved a Silver Award – none have as yet been awarded Gold.The Silver Award recognises that we have gone beyond simply identifying problem areas in relation to gender inequality, but that we have been successful in implementing strategies that address these issues; and furthermore have been able to measure our progress towards our goals.The Athena SWAN Charter was established in 2005 to encourage and recognise commitment to advancing the careers of women in science, technology, engineering, maths and medicine (STEMM) employment in higher education and research. In May 2015 the charter was expanded to recognise work undertaken in arts, humanities, social sciences, business and law (AHSSBL), and in professional and support roles, and for trans staff and students. The charter now recognises work undertaken to address gender equality more broadly, and not just barriers to progression that affect women. More information about the charter can be found at http://www.ecu.ac.uk/equality-charters/athena-swan/. John Shawe-Taylor, Head of Department, says:\"I would like to thank the whole team behind our application for the very substantial amount of work that has gone into achieving this. Particular thanks are due to Caroline Wardle and Jane Butler for their leading role in the application preparation\".Our current Athena SWAN team responsible for seeing through the implementation of our action plan and working towards an application for a Gold Award is being led by Ivana Drobnjak and Alexandra Silva. We will be making regular updates on how things are progressing: anyone interested in being more closely involved, please do not hesitate to contact one of the team.For more information about the team see http://www.cs.ucl.ac.uk/wics/home/. Thanks go to the following team members:Earl BarrJane ButlerIvana DrobnjakJJ Giwa- MajekodunmiStephen HailesRae HarbirdGuy LeverNuray MuzaffarovaGraham RobertsJohn Shawe-Taylor Dave TwisletonCaroline WardleTim WeyrichManisha VermaAnna ZarembaPosted 29 Apr 16 12:31Next: Dr Venus Shum featured... >< Previous: Public events announced...< Back to: Computer Science News2016: 65 items2015: 49 items2014: 43 items2013: 37 itemsThis page was last modified on 25 Jan 2017 and is maintained by Graham Knight Computer Science DepartmentUniversity College LondonGower StreetLondonWC1E 6BT +44 (0)20 7679 7214Disclaimer|Cookies|Accessibility|Privacy|Advanced Search|HelpCopyright ©  1999-2017   UCL", "link": "http://www.cs.ucl.ac.uk/computer_science_news/article/athena-swan-silver-award-for-ucl-computer-science/"},
{"content": "Department of Computer Science› Home ›› DegreesMobile VersionHomeProspective StudentsResearchIndustry & OutreachCareersCurrent StudentsPeopleAbout UsWomen in Computer ScienceStaff IntranetForthcoming Events21 Mar 13:00Intelligent Systems Seminar:  Julia: Solving the two language problem in machine learning22 Mar 13:00CMIC Seminar: Kin Quan and Claire Cury23 Mar 13:00UCLIC Seminar: Human-in-the-Loop Cyber-Physical Systems using smartphones23 Mar 16:00InfoSec Seminar: Characterization of Internet Censorship from Multiple...28 Mar 13:00Virtual Open Day: MSc Robotics and Computation29 Mar 15:00Virtual Open Day: MSc Computational Finance05 Apr 17:00Inaugural Lecture: Data-Driven MedicineOur Degreesgoogle.load('search', '1', {language: 'en', style: google.loader.themes.ESPRESSO});  .gsc-control-cse {    font-family: Arial, sans-serif;    border-color: #ECECEC;    background-color: #ECECEC;  }  .gsc-control-cse .gsc-table-result {    font-family: Arial, sans-serif;  }  input.gsc-input {    border-color: #CCCCCC;  }  input.gsc-search-button {    border-color: #CCCCCC;    background-color: #CCCCCC;  }  .gsc-tabHeader.gsc-tabhInactive {    border-color: #965700;    background-color: #965700;  }  .gsc-tabHeader.gsc-tabhActive {    border-color: #C96500;    background-color: #C96500;  }  .gsc-tabsArea {    border-color: #965700;  }  .gsc-webResult.gsc-result, .gsc-results .gsc-imageResult {    border-color: #ECECEC;    background-color: #ECECEC;  }  .gsc-webResult.gsc-result:hover, .gsc-imageResult:hover {    border-color: #CCCCCC;    background-color: #CCCCCC;  }  .gsc-webResult.gsc-result.gsc-promotion:hover {    border-color: #CCCCCC;    background-color: #CCCCCC;  }  .gs-webResult.gs-result a.gs-title:link, .gs-webResult.gs-result a.gs-title:link b, .gs-imageResult a.gs-title:link, .gs-imageResult a.gs-title:link b  {    color: #C96500;  }  .gs-webResult.gs-result a.gs-title:visited, .gs-webResult.gs-result a.gs-title:visited b, .gs-imageResult a.gs-title:visited, .gs-imageResult a.gs-title:visited b {    color: #C96500;  }  .gs-webResult.gs-result a.gs-title:hover, .gs-webResult.gs-result a.gs-title:hover b, .gs-imageResult a.gs-title:hover, .gs-imageResult a.gs-title:hover b {    color: #965700;  }  .gs-webResult.gs-result a.gs-title:active, .gs-webResult.gs-result a.gs-title:active b, .gs-imageResult a.gs-title:active, .gs-imageResult a.gs-title:active b {    color: #C96500;  }  .gsc-cursor-page {    color: #C96500;  }  a.gsc-trailing-more-results:link {    color: #C96500;  }  .gs-webResult .gs-snippet, .gs-imageResult .gs-snippet, .gs-fileFormatType {    color: #393746;  }  .gs-webResult div.gs-visibleUrl, .gs-imageResult div.gs-visibleUrl {    color: #C96500;  }  .gs-webResult div.gs-visibleUrl-short {    color: #C96500;  }  .gs-webResult div.gs-visibleUrl-short  {    display: none;  }  .gs-webResult div.gs-visibleUrl-long {    display: block;  }  .gs-promotion div.gs-visibleUrl-short {    display: none;  }  .gs-promotion div.gs-visibleUrl-long  {    display: block;  }  .gsc-cursor-box {    border-color: #ECECEC;  }  .gsc-results .gsc-cursor-box .gsc-cursor-page {    border-color: #C96500;    background-color: #ECECEC;    color: #C96500;  }  .gsc-results .gsc-cursor-box .gsc-cursor-current-page {    border-color: #965700;    background-color: #965700;    color: #C96500;  }  .gsc-webResult.gsc-result.gsc-promotion {    border-color: #FEFEDC;    background-color: #FFFFCC;  }  .gsc-completion-title {    color: #C96500;  }  .gsc-completion-snippet {    color: #393746;  }  .gs-promotion a.gs-title:link,.gs-promotion a.gs-title:link *,.gs-promotion .gs-snippet a:link  {    color: #0000CC;  }  .gs-promotion a.gs-title:visited,.gs-promotion a.gs-title:visited *,.gs-promotion .gs-snippet a:visited {    color: #0000CC;  }  .gs-promotion a.gs-title:hover,.gs-promotion a.gs-title:hover *,.gs-promotion .gs-snippet a:hover  {    color: #0000CC;  }  .gs-promotion a.gs-title:active,.gs-promotion a.gs-title:active *,.gs-promotion .gs-snippet a:active {    color: #0000CC;  }  .gs-promotion .gs-snippet, .gs-promotion .gs-title .gs-promotion-title-right, .gs-promotion .gs-title .gs-promotion-title-right * {    color: #333333;  }  .gs-promotion .gs-visibleUrl,.gs-promotion .gs-visibleUrl-short  {    color: #A25B08;  }Undergraduate DegreesUndergraduate DegreesBSc Computer ScienceMEng Computer Science (with optional year abroad)MEng Mathematical ComputationPostgraduate MSc DegreesMSc Degree ProgrammesSubject Specialist Degrees:MSc Business AnalyticsMSc Computational FinanceMSc Computational Statistics and Machine Learning MSc Computer Graphics, Vision and ImagingMSc Data ScienceMSc Financial Risk ManagementMSc Financial Systems EngineeringMSc Human-Computer Interaction with ErgonomicsMSc Information SecurityMSc Logic, Semantics, and Verification of ProgramsMSc Machine LearningMSc Robotics and ComputationMSc Software Systems EngineeringMSc Web Science and Big Data AnalyticsMSc Computer Science - Mahidol University, ThailandGeneralist Degrees for NON-Computer Science Graduates only:MSc Computer ScienceComputer Science related Degrees:MSc Scientific ComputingResearch DegreesMRes Degrees ProgrammesLike our MSc programmes, MRes programmes are one calender year but with more emphasis on research through a longer research project and a corresponding reduction in the number of taught modules. MRes's are therefore an excellent preparation for entering a PhD programme, indeed many Doctoral Training Centres (DTC's) such as our DTC in Financial Computing have an initial MRes training year. We will be offering a number of competitive scholarships for our PhD programmes that those taking our MRes programmes will be eligible to apply for.We currently offer:MRes Computational Statistics & Machine LearningMRes Financial ComputingMRes RoboticsMRes Virtual RealityMRes Web Science & Big Data AnalyticsOther Research Degrees in Engineering...PhD Degree Programmes PhD programme: allows students to conduct research in any of the wide range of specialities.EngD programme: run in collaboration with the Bartlett School of Architecture and focuses on research in Virtual Environments, Imaging and Visualisation.UK PhD Centre in Financial Computing: UCL in collaboration with the London School of Economics (LSE) and the London Business School (LBS) and twenty leading financial institutions have been awarded £7m (€8m) by the UK Government to establish a national PhD training centre in Financial Computing.UCL SECReT: the new £17m national centre for PhD training in security and crime science at University College London, the first centre of its kind in Europe.UCL EPSRC Centre for Doctoral Training in Medical Imaging: offers a 4 year programme in Medical Imaging. There is a strong focus on new image acquisition technologies, novel data analysis methods and integration with computational modelling.Virtual Open DaysRegistration is now open for Computer Science's Virtual Open Days. The Open Days are for anyone interested in studying BSc, MEng, MSc & MRes level programmes.Join us online to chat to our Admissions Tutor, Teaching Staff, Programme Administrator and current students. To join, please register here and we will send you a link just prior to the Open Day. Upcoming Virtual Open Days:MSc Robotics and Computation, Tuesday 28th March, 1-2pmMSc Computational Finance, Wednesday 29th March, 3-4pmWhy study with usWhy choose UCLEmployabilityFacilitiesIndustry#1 for Research360 ToursWhy choose UCLWe are one of the world's best universities, consistently placed in the global top 20 in a wide range of world rankings. Currently we are 5th in the QS World University Rankings, and 4th in Europe in the Shanghai Jiao Tong Academic World Rankings. UCL has a global outlook, nearly 40% of our students come from over 150 countries worldwide – UCL enjoys a friendly and cosmopolitan atmosphere. We also support ambition; UCL Advances, our centre for entrepreneurship, offers networking and business support, and the chance to win start-up funding for UCL students seeking to start their own business.EmployabilityOur graduates are particularly valued because of UCL’s international reputation, the Department’s strong links with top industry partners, and an ideal location close to the City of London. Throughout the year we offer a programme of careers events aimed at sharpening the key skills needed to improve students’ employability. 95% of our graduates find work or further study six months after graduation, and a Computer Science graduate enjoys an average starting salary of £32,120 (according up-to-date graduate surveys). Recent graduate destinations include Microsoft, IBM, Google, Cisco, Deutsche and JP Morgan.FacilitiesUCL is home to the largest educational Stock-Trading Floor in London, where real-time data feeds from major global stock exchanges recreate the excitement an investment bank trading floor. Students can also experiment in 3-D our Immersive Virtual Environments Lab, which uses high-resolution stereo-pair images, projected in real-time on three walls and the floor, to recreate virtual scenarios. Computer facilities include a multi-apps studio lab installed with touch screens and local device connectivity; a 3-D lab with 3-D printing connectivity; and a 300-user cluster virtual lab which students can use remotely. IndustryWe enjoy growing our relationships with exciting start-ups on Silicon Roundabout, as well as collaborating closely with world-leading technology and finance companies. This means students engage with industry throughout their course - they work on real-world projects with industry clients; are awarded industry prizes; attend guest lectures delivered by industry experts; and can benefit from ongoing support from our alumni mentoring service. Internships with industry partners are available throughout the year.#1 for ResearchThe 2014 Research Excellence Framework (REF) evaluation ranked UCL 1st for Computer Science in the UK, out of 89 Universities assessed, and considerably ahead of other Institutions. 61% of our research work is now rated as world-leading (the highest possible category), and 96% of our research work is now rated as internationally excellent. Our research has made a deep, lasting and sustained impact on today’s society. Code written at UCL is used  across all 3G mobile networks for instant messaging and videoconferencing; medical image computing has led to faster prostate cancer diagnosis and has developed tools to help neurosurgeons avoid damagingessential communication pathways during brain surgery; and our human-centred approach to computer security has transformed the UK government’s delivery of online security.Take a 360 virtual tour of our Immersive Display Lab and our Touch LabAbout usSome of our undergraduates made a short video about studying Computer Science and life as a student at UCL.Our research makes a deep and lasting impact on all aspects of society. See how our work is modelling the world around us.Dr Dan Stoyanov tells us about the wide array of options available to Computer Science students at UCL.UCLU Tech Society connects students with industry through events and initiatives and is free for students to join. This page was last modified on 14 Mar 2017 and is maintained by Graham Knight Computer Science DepartmentUniversity College LondonGower StreetLondonWC1E 6BT +44 (0)20 7679 7214Disclaimer|Cookies|Accessibility|Privacy|Advanced Search|HelpCopyright ©  1999-2017   UCL", "link": "http://www.cs.ucl.ac.uk/degrees/"}
]